nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmrw612/lvgl_examples/pin_mux.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 24.12.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: F6, peripheral: FLEXCOMM3, signal: USART_TXD, pin_signal: GPIO_26}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24, GPIO_26 (pin E5_F6) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLcd0Pins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: FLEXCOMM2, signal: I2C_SCL, pin_signal: GPIO_17}
  - {pin_num: J3, peripheral: FLEXCOMM2, signal: I2C_SDA, pin_signal: GPIO_16}
  - {pin_num: M6, peripheral: FLEXCOMM1, signal: SPI_MISO, pin_signal: GPIO_8}
  - {pin_num: L9, peripheral: FLEXCOMM1, signal: SPI_SCK, pin_signal: GPIO_7}
  - {pin_num: M4, peripheral: FLEXCOMM1, signal: SPI_MOSI, pin_signal: GPIO_9}
  - {pin_num: L5, peripheral: FLEXCOMM1, signal: SPI_SSELN0, pin_signal: GPIO_6}
  - {pin_num: K8, peripheral: GPIO, signal: 'PIO1, 20', pin_signal: GPIO_52}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLcd0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitLcd0Pins(void)
{
    /* Initialize FC1_SPI_SS0 functionality on pin GPIO_8, GPIO_7, GPIO_9, GPIO_6 (pin M6_L9_M4_L5) */
    IO_MUX_SetPinMux(IO_MUX_FC1_SPI_SS0);
    /* Initialize FC2_I2C_16_17 functionality on pin GPIO_17, GPIO_16 (pin H2_J3) */
    IO_MUX_SetPinMux(IO_MUX_FC2_I2C_16_17);
    /* Initialize GPIO52 functionality on pin GPIO_52 (pin K8) */
    IO_MUX_SetPinMux(IO_MUX_GPIO52);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLcd1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F12, peripheral: LCDIC, signal: LCD_SPI_DATA, pin_signal: GPIO_46}
  - {pin_num: D14, peripheral: LCDIC, signal: LCD_SPI_SS, pin_signal: GPIO_49}
  - {pin_num: J11, peripheral: LCDIC, signal: LCD_SPI_RESET, pin_signal: GPIO_44}
  - {pin_num: H10, peripheral: LCDIC, signal: LCD_SPI_TE, pin_signal: GPIO_45}
  - {pin_num: E13, peripheral: LCDIC, signal: LCD_SPI_DC, pin_signal: GPIO_47}
  - {pin_num: D13, peripheral: LCDIC, signal: LCD_SPI_SCK, pin_signal: GPIO_48}
  - {pin_num: H2, peripheral: FLEXCOMM2, signal: I2C_SCL, pin_signal: GPIO_17}
  - {pin_num: J3, peripheral: FLEXCOMM2, signal: I2C_SDA, pin_signal: GPIO_16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLcd1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitLcd1Pins(void)
{
    /* Initialize FC2_I2C_16_17 functionality on pin GPIO_17, GPIO_16 (pin H2_J3) */
    IO_MUX_SetPinMux(IO_MUX_FC2_I2C_16_17);
    /* Initialize LCD_SPI functionality on pin GPIO_46, GPIO_49, GPIO_44, GPIO_45, GPIO_47, GPIO_48 (pin
     * F12_D14_J11_H10_E13_D13) */
    IO_MUX_SetPinMux(IO_MUX_LCD_SPI);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
